backend/app/controllers/items_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "billmurray"], ["LIMIT", 1]]
INSERT INTO "items" ("title", "description", "state", "city", "location", "created_at", "updated_at", "category", "price", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)
    @item.user_id = User.find_by(username: params[:username]).id

    if @item.save

UPDATE "items" SET "updated_at" = ? WHERE "items"."id" = ?  [["updated_at", "2020-11-29 22:53:43.778172"], ["id", 1]]
---
  def update
    if @item.update(item_params)

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def upload_picture
    @item = Item.find_by(id: picture_params[:id])