backend/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "username", "phone_number") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @user = User.new(user_params)
        if @user.save

UPDATE "users" SET "updated_at" = ? WHERE "users"."id" = ?  [["updated_at", "2020-11-29 22:48:45.176755"], ["id", 7]]
---
    def update
        unless @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "billmurray"], ["LIMIT", 1]]
---
    def upload_avatar
        @user = User.find_by(username: avatar_params[:username])

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "08fdange"], ["LIMIT", 1]]
---
        def find_user
            @user = User.find_by(username: params[:username])